ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map("map", {
            center: [60.604753,56.831483],
            zoom: 11,
            controls: []
        }, {
            searchControlProvider: 'yandex#search'
        });

            // 1
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.511736,56.814436],[60.522894,56.810199],[60.540919,56.803419],[60.573363,56.790986],[60.579543,56.788442],[60.578341,56.763844],[60.573535,56.739135],[60.554137,56.750171],[60.517315,56.773082],[60.454981,56.789408]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №1</span><br><br>' +
             '<a href = "../cities/district_1.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №1<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#4CF016',
        // Цвет обводки.
        strokeColor: 'FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

            // 2
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.58988,56.814113],[60.590553,56.812647],[60.590915,56.811201],[60.591865,56.808879],[60.592413,56.807263],[60.592769,56.806117],[60.594166,56.801806],[60.595233,56.798742],[60.595804,56.797216],[60.596177,56.79627],[60.597828,56.789875],[60.594286,56.789398],[60.589672,56.788883],[60.585229,56.788426],[60.582955,56.788441],[60.580079,56.788821],[60.575293,56.79057],[60.568211,56.793185],[60.556339,56.797689],[60.54491,56.802003],[60.538673,56.804366],[60.540631,56.805892],[60.542931,56.80763],[60.54426,56.808731],[60.545911,56.810068],[60.54801,56.811722],[60.5495,56.812911],[60.550969,56.814118],[60.552234,56.813829],[60.553275,56.813599],[60.555216,56.813357],[60.55988,56.811633],[60.566259,56.809182],[60.572837,56.806718],[60.575006,56.808443],[60.576594,56.809762],[60.57814,56.810987],[60.578711,56.811436],[60.580485,56.812102],[60.581411,56.812439],[60.582984,56.812965],[60.586152,56.813587]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №2</span><br><br>' +
             '<a href = "../cities/district_2.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №2<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#5962FF',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 3
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.584725,56.829389],[60.583523,56.829224],[60.583089,56.82896],[60.581066,56.827942],[60.580076,56.827546],[60.572971,56.825891],[60.572393,56.825624],[60.57235,56.825146],[60.570291,56.825221],[60.56909,56.825259],[60.568328,56.825308],[60.566081,56.825389],[60.564048,56.825471],[60.561238,56.825513],[60.559861,56.825638],[60.558483,56.825656],[60.555262,56.825545],[60.554263,56.825536],[60.55204,56.825704],[60.546366,56.826128],[60.543653,56.826317],[60.54066,56.826518],[60.534442,56.826969],[60.533995,56.825237],[60.535265,56.823969],[60.536744,56.82255],[60.538072,56.821483],[60.536862,56.820787],[60.536408,56.820486],[60.536264,56.820173],[60.536584,56.8198],[60.539865,56.818283],[60.543428,56.816688],[60.546712,56.815158],[60.547922,56.814721],[60.551921,56.81376],[60.55359,56.813415],[60.555077,56.813211],[60.55961,56.811583],[60.565084,56.809484],[60.568573,56.808186],[60.570646,56.807358],[60.572861,56.80648],[60.574955,56.80822],[60.576101,56.809063],[60.577119,56.80993],[60.578169,56.810768],[60.579859,56.811726],[60.580959,56.812081],[60.582099,56.812523],[60.583411,56.812895],[60.584796,56.813194],[60.586494,56.81349],[60.589951,56.813916],[60.58991,56.814152],[60.589525,56.814982],[60.589269,56.815444],[60.589119,56.815918],[60.588874,56.816754],[60.588667,56.817492],[60.58856,56.818243],[60.588357,56.818906],[60.587887,56.82022],[60.587616,56.821127],[60.587292,56.822052],[60.58662,56.823765],[60.586226,56.824743],[60.58581,56.82605],[60.58549,56.827091],[60.585084,56.828186],[60.584958,56.828569],[60.58488,56.828829],[60.584784,56.829103]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №3</span><br><br>' +
             '<a href = "../cities/district_3.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №3<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FCE90F',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);


            // 4
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.589553,56.847966],[60.587981,56.848289],[60.586366,56.848483],[60.58502,56.848398],[60.583609,56.848195],[60.581667,56.847542],[60.577687,56.846831],[60.575439,56.847651],[60.573353,56.84788],[60.57144,56.847262],[60.571071,56.846291],[60.570844,56.84517],[60.569271,56.843175],[60.568227,56.842413],[60.567541,56.842114],[60.566182,56.842141],[60.564365,56.84239],[60.552535,56.842056],[60.536048,56.838775],[60.535705,56.836729],[60.53559,56.835086],[60.535581,56.833674],[60.535394,56.832868],[60.534595,56.832897],[60.534569,56.831894],[60.532928,56.831957],[60.532671,56.830906],[60.529733,56.831035],[60.529448,56.827293],[60.531404,56.827155],[60.541171,56.826477],[60.544297,56.826272],[60.54774,56.826026],[60.554337,56.825534],[60.554989,56.825513],[60.555609,56.825551],[60.556892,56.825626],[60.558261,56.825663],[60.559503,56.825667],[60.561787,56.82544],[60.563454,56.825342],[60.567301,56.825266],[60.569397,56.825123],[60.572708,56.825051],[60.572746,56.825377],[60.572768,56.82559],[60.57294,56.825709],[60.574029,56.82601],[60.575177,56.826288],[60.57744,56.826843],[60.578805,56.827165],[60.579565,56.827276],[60.580314,56.827469],[60.580808,56.827669],[60.581248,56.827899],[60.582261,56.82839],[60.583052,56.828807],[60.58381,56.829167],[60.584174,56.829232],[60.584731,56.82927],[60.584507,56.829952],[60.584262,56.830661],[60.583815,56.832055],[60.583605,56.832593],[60.583421,56.833009],[60.58314,56.83378],[60.582556,56.835206],[60.581432,56.838225],[60.580773,56.839746],[60.58039,56.84083],[60.580768,56.841156],[60.582808,56.84266],[60.58487,56.844147],[60.586129,56.845055],[60.587174,56.846056]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №4</span><br><br>' +
             '<a href = "../cities/district_4.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №4<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#31AAB0',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);


            // 5
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.554791,56.876955],[60.554025,56.876197],[60.553424,56.875595],[60.552271,56.87442],[60.551391,56.87353],[60.550538,56.872666],[60.549937,56.87207],[60.549707,56.8718],[60.549573,56.871621],[60.549449,56.8714],[60.549363,56.871241],[60.549321,56.871003],[60.54931,56.870668],[60.549374,56.870052],[60.549492,56.86872],[60.549551,56.867874],[60.549669,56.866232],[60.549744,56.865487],[60.549819,56.864131],[60.549884,56.863077],[60.549932,56.862901],[60.549937,56.862551],[60.549878,56.862011],[60.549809,56.861535],[60.549573,56.860503],[60.549519,56.859848],[60.549589,56.858736],[60.549594,56.858554],[60.54976,56.85697],[60.549863,56.856478],[60.550072,56.855994],[60.550432,56.85545],[60.551075,56.854739],[60.551971,56.853723],[60.552797,56.852859],[60.553664,56.851932],[60.555128,56.850302],[60.555949,56.849383],[60.556278,56.849023],[60.55705,56.848421],[60.5582,56.847788],[60.559945,56.846859],[60.560556,56.84645],[60.561044,56.846009],[60.561372,56.845692],[60.561608,56.845378],[60.56185,56.844949],[60.562011,56.844585],[60.562188,56.844032],[60.562301,56.843493],[60.562392,56.842214],[60.563379,56.842244],[60.564366,56.842368],[60.566404,56.842151],[60.567209,56.842067],[60.567928,56.84217],[60.56892,56.842899],[60.56956,56.84335],[60.569856,56.843777],[60.570865,56.845341],[60.571285,56.846742],[60.57186,56.847266],[60.572692,56.847556],[60.573867,56.847797],[60.575257,56.84785],[60.576064,56.847599],[60.576656,56.847207],[60.577505,56.846861],[60.578397,56.846869],[60.58131,56.847309],[60.583987,56.84782],[60.586707,56.847861],[60.589577,56.847807],[60.590494,56.848486],[60.59139,56.849153],[60.591983,56.849605],[60.592661,56.850092],[60.593943,56.850961],[60.595478,56.851996],[60.596958,56.85303],[60.598326,56.853978],[60.59963,56.854849],[60.601153,56.855854],[60.602419,56.856106],[60.604286,56.85633],[60.608272,56.856771],[60.612247,56.857076],[60.612933,56.85723],[60.613114,56.857684],[60.613564,56.858355],[60.613435,56.859003],[60.613311,56.859973],[60.613015,56.860897],[60.612509,56.86278],[60.61227,56.865399],[60.612032,56.868054],[60.611793,56.872239],[60.611275,56.877247],[60.594117,56.872149],[60.570435,56.867707]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №5</span><br><br>' +
             '<a href = "../cities/district_5.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №5<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#F7FA5A',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 6
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.491781,56.879798],[60.496512,56.883637],[60.499613,56.885931],[60.50252,56.887895],[60.503931,56.888907],[60.505173,56.889201],[60.506629,56.889419],[60.507085,56.889346],[60.507928,56.889114],[60.522551,56.885197],[60.55448,56.875852],[60.550215,56.871656],[60.549963,56.870957],[60.549953,56.869652],[60.55006,56.868171],[60.550253,56.866279],[60.550543,56.863082],[60.550489,56.859779],[60.550586,56.859073],[60.55094,56.85825],[60.544105,56.859144],[60.536928,56.861448],[60.519461,56.868172]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №6</span><br><br>' +
             '<a href = "../cities/district_6.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №6<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#5DCF4B',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

    // 7
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.581517,56.902565],[60.578556,56.900276],[60.580186,56.899653],[60.578084,56.898009],[60.568084,56.901732],[60.56815,56.899041],[60.573548,56.896826],[60.572728,56.896141],[60.574678,56.895365],[60.573186,56.894178],[60.571565,56.893426],[60.570953,56.892345],[60.569611,56.891123],[60.567458,56.889128],[60.566785,56.889364],[60.565587,56.888208],[60.565075,56.887651],[60.561154,56.883958],[60.557427,56.87996],[60.6141,56.887005],[60.614061,56.890219],[60.598025,56.89641],[60.595999,56.897205],[60.593887,56.897964],[60.589749,56.899529]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №7</span><br><br>' +
             '<a href = "../cities/district_7.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №7<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#DDA0DD',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 8
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.610334,56.914609],[60.610114,56.915066],[60.610895,56.915124],[60.610524,56.91665],[60.609809,56.916696],[60.610519,56.919457],[60.611402,56.922217],[60.612177,56.924989],[60.612652,56.927151],[60.613939,56.927089],[60.613635,56.92492],[60.61303,56.92281],[60.611949,56.919811],[60.611303,56.917656],[60.611044,56.916815],[60.611769,56.914006],[60.613135,56.90982],[60.61421,56.90392],[60.614512,56.900911],[60.615028,56.897854],[60.613832,56.89009],[60.594574,56.89749],[60.590416,56.899077],[60.586731,56.900479],[60.584355,56.901413],[60.581538,56.902519],[60.582559,56.903239],[60.584218,56.904633],[60.582443,56.905357],[60.583679,56.906283],[60.585402,56.905589],[60.587726,56.907303],[60.58606,56.907942],[60.587195,56.908846],[60.583137,56.910395],[60.585701,56.91226],[60.592696,56.909551],[60.596602,56.912209],[60.598393,56.912859],[60.600271,56.913345],[60.602787,56.9136],[60.602513,56.914582],[60.605313,56.914799],[60.605506,56.913912],[60.609493,56.914231],[60.609236,56.914525]
                ]
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №8</span><br><br>' +
             '<a href = "../cities/district_8.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №8<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

    // 9
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.613306,56.888532],[60.613505,56.890655],[60.613811,56.892847],[60.614138,56.894899],[60.614293,56.896997],[60.614154,56.898822],[60.613972,56.900659],[60.613757,56.902049],[60.613499,56.90365],[60.613242,56.906454],[60.612877,56.908342],[60.612169,56.910476],[60.611053,56.914392],[60.613218,56.914574],[60.614279,56.91457],[60.615339,56.91445],[60.616585,56.914093],[60.61753,56.913594],[60.618341,56.913084],[60.618937,56.912574],[60.619656,56.911506],[60.621482,56.911332],[60.623351,56.911333],[60.627291,56.912015],[60.630801,56.912463],[60.635333,56.911104],[60.642434,56.905637],[60.644145,56.905181],[60.646328,56.904653],[60.650136,56.901485],[60.651549,56.897736],[60.651286,56.887275],[60.62389,56.878059],[60.610613,56.877699],[60.610455,56.879767],[60.612157,56.882234],[60.61348,56.884031],[60.613948,56.884941],[60.613709,56.885992],[60.613207,56.887227]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №9</span><br><br>' +
             '<a href = "../cities/district_9.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №9<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FFFF',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 10
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.610449,56.878054],[60.617133,56.878265],[60.620454,56.878377],[60.62371,56.878524],[60.630104,56.880674],[60.644384,56.885399],[60.647716,56.88247],[60.649717,56.880785],[60.651697,56.879029],[60.653828,56.877779],[60.656022,56.876529],[60.661511,56.873346],[60.667214,56.870139],[60.670495,56.868147],[60.672371,56.86714],[60.673453,56.866567],[60.667368,56.863671],[60.661282,56.860797],[60.651197,56.855925],[60.640522,56.850833],[60.635785,56.848705],[60.633803,56.845718],[60.632919,56.844319],[60.632542,56.844001],[60.630962,56.843801],[60.63016,56.845405],[60.629352,56.846072],[60.627341,56.847608],[60.624694,56.849588],[60.621918,56.851709],[60.618509,56.854406],[60.616847,56.855754],[60.614842,56.857244],[60.611786,56.857035],[60.612871,56.858236],[60.612947,56.859002],[60.612825,56.859597],[60.612702,56.860051],[60.611999,56.861298],[60.611618,56.862875],[60.611372,56.865898],[60.61113,56.86892],[60.610889,56.871941],[60.610744,56.875004]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №10</span><br><br>' +
             '<a href = "../cities/district_10.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №10<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FF3D1F',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

         // 11
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.630993,56.844009],[60.631949,56.84411],[60.632277,56.844121],[60.63253,56.844161],[60.632945,56.844849],[60.633702,56.845978],[60.634399,56.847047],[60.635075,56.848135],[60.635361,56.848585],[60.635443,56.848665],[60.63564,56.84883],[60.636226,56.849115],[60.637376,56.849636],[60.638683,56.850234],[60.639352,56.850565],[60.640263,56.850985],[60.645721,56.853579],[60.651302,56.856234],[60.662434,56.861606],[60.665355,56.863003],[60.668297,56.864382],[60.674332,56.867174],[60.674756,56.867366],[60.674882,56.867048],[60.674699,56.866841],[60.674445,56.866453],[60.67437,56.866257],[60.674322,56.866068],[60.674304,56.865788],[60.674264,56.865432],[60.674072,56.864019],[60.674329,56.863136],[60.674274,56.8623],[60.674156,56.861423],[60.674037,56.86054],[60.674242,56.859336],[60.67419,56.85771],[60.673914,56.854715],[60.67386,56.853228],[60.672631,56.852343],[60.671116,56.850373],[60.669429,56.847555],[60.669246,56.84568],[60.669622,56.841852],[60.669214,56.83843],[60.669955,56.835966],[60.671124,56.832796],[60.672326,56.831537],[60.674085,56.830631],[60.677926,56.829314],[60.680651,56.827808],[60.681488,56.826928],[60.681724,56.826048],[60.681252,56.824665],[60.678892,56.823136],[60.675158,56.822736],[60.67136,56.823395],[60.667905,56.824195],[60.660309,56.826195],[60.647563,56.830218],[60.640418,56.8325],[60.63426,56.83525],[60.633855,56.836313],[60.633503,56.837376],[60.633088,56.83844],[60.63288,56.838972],[60.632704,56.839516],[60.632508,56.840076],[60.632279,56.840676],[60.631843,56.84186]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №11</span><br><br>' +
             '<a href = "../cities/district_11.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №11<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#3ACCFC',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

             // 12
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.669139,56.835459],[60.66852,56.83741],[60.668072,56.839396],[60.66803,56.840706],[60.668031,56.842029],[60.669665,56.842074],[60.680936,56.842239],[60.688344,56.843321],[60.689623,56.843235],[60.690903,56.843078],[60.691444,56.842071],[60.691863,56.841673],[60.692067,56.841417],[60.692839,56.840758],[60.694427,56.839415],[60.695114,56.838764],[60.694974,56.837364],[60.694491,56.834469],[60.693993,56.830112],[60.693279,56.825837],[60.69256,56.825532],[60.691123,56.825402],[60.690414,56.825408],[60.689953,56.825443],[60.689427,56.825484],[60.688022,56.825832],[60.687207,56.826079],[60.682232,56.827668],[60.677183,56.829269],[60.67451,56.830043],[60.672568,56.830793],[60.671779,56.831192],[60.671204,56.831755],[60.670227,56.832906],[60.66978,56.833841]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №12</span><br><br>' +
             '<a href = "../cities/district_12.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №12<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#44A603',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

         // 13
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.614862,56.857512],[60.608189,56.856995],[60.604434,56.856604],[60.600989,56.856184],[60.599348,56.855081],[60.59417,56.851617],[60.589164,56.848088],[60.586801,56.846139],[60.585609,56.845146],[60.584523,56.844295],[60.582042,56.842547],[60.579871,56.840953],[60.581677,56.836145],[60.582612,56.833776],[60.583187,56.832539],[60.583431,56.83202],[60.584416,56.832154],[60.589581,56.832814],[60.59314,56.833232],[60.596398,56.83365],[60.602748,56.8343],[60.605977,56.834673],[60.607098,56.834706],[60.609238,56.834975],[60.611632,56.835202],[60.613966,56.835292],[60.616865,56.835608],[60.618707,56.835818],[60.620173,56.835988],[60.626956,56.836798],[60.633654,56.837567],[60.632964,56.839347],[60.632318,56.841128],[60.631482,56.843211],[60.630753,56.845164],[60.628652,56.846912],[60.627526,56.847756],[60.626271,56.848648],[60.616148,56.856461]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №13</span><br><br>' +
             '<a href = "../cities/district_13.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №13<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#44A603',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 14
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                [
                    [60.58319,56.832148],[60.599863,56.834288],[60.601387,56.834335],[60.611536,56.835512],[60.61454,56.835582],[60.633573,56.837841],[60.634759,56.838003],[60.636073,56.834719],[60.637366,56.833399],[60.638388,56.832651],[60.63971,56.832232],[60.653808,56.828153],[60.664746,56.824685],[60.667079,56.823736],[60.668125,56.82281],[60.667583,56.821597],[60.66511,56.820346],[60.662294,56.819632],[60.658593,56.819192],[60.655422,56.819028],[60.651093,56.81877],[60.640761,56.818069],[60.620417,56.816603],[60.619577,56.819149],[60.606976,56.81764],[60.605171,56.817108],[60.596242,56.816401],[60.588684,56.815774],[60.586969,56.8213],[60.585619,56.82504],[60.584933,56.826896],[60.584212,56.829522]
                ]
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №14</span><br><br>' +
             '<a href = "../cities/district_14.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №14<br> Нажмите для выбора'
            
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FFB6C1',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 15
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                [
                    [60.627254,56.817494],[60.631862,56.817814],[60.636566,56.818152],[60.639442,56.818274],[60.655117,56.817837],[60.656071,56.814664],[60.656108,56.813546],[60.655672,56.812358],[60.654682,56.810047],[60.654226,56.809189],[60.653786,56.808315],[60.652842,56.80661],[60.651729,56.805409],[60.651036,56.804822],[60.650305,56.804284],[60.648673,56.803349],[60.646906,56.802479],[60.645743,56.801912],[60.644595,56.801318],[60.643957,56.800893],[60.643045,56.800142],[60.642579,56.799757],[60.642251,56.799332],[60.641808,56.798564],[60.64151,56.797761],[60.641059,56.796654],[60.640855,56.796113],[60.640629,56.795615],[60.631861,56.798274],[60.62952,56.797486],[60.62469,56.796675],[60.610867,56.796783],[60.608802,56.794489],[60.605879,56.792312],[60.605448,56.791701],[60.605188,56.791019],[60.597669,56.790116],[60.595186,56.797964],[60.593439,56.8034],[60.592263,56.806715],[60.589783,56.813354],[60.588676,56.815968],[60.595707,56.816545],[60.599995,56.816881],[60.604101,56.817223],[60.604778,56.817294],[60.605326,56.81736],[60.605821,56.81748],[60.606236,56.817649],[60.606779,56.817784],[60.607361,56.817919],[60.608104,56.818031],[60.611649,56.81842],[60.619813,56.819338],[60.620709,56.816947]
                ]
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №15</span><br><br>' +
             '<a href = "../cities/district_15.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №15<br> Нажмите для выбора'
            
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#1EFAC3',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

            // 16
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                [
                    [60.642339,56.799938],[60.648014,56.797542],[60.651286,56.796221],[60.654623,56.794958],[60.657627,56.794069],[60.661039,56.793109],[60.665867,56.791749],[60.671017,56.790312],[60.675576,56.78902],[60.680168,56.787716],[60.693253,56.7841],[60.69942,56.782369],[60.704423,56.780943],[60.705372,56.780596],[60.705779,56.780097],[60.706123,56.778715],[60.705297,56.777146],[60.674065,56.767301],[60.672075,56.766862],[60.669741,56.766517],[60.666743,56.766278],[60.664216,56.766299],[60.662778,56.767153],[60.661598,56.768467],[60.660633,56.770824],[60.659839,56.774075],[60.657757,56.77543],[60.653594,56.776374],[60.649324,56.776775],[60.642694,56.775598],[60.633671,56.771864],[60.62917,56.769747],[60.628559,56.768884],[60.628336,56.767133],[60.626434,56.767181],[60.624216,56.767231],[60.622073,56.767252],[60.620336,56.767455],[60.6186,56.767682],[60.615276,56.783687],[60.614024,56.785707],[60.611655,56.787444],[60.608472,56.789393],[60.60503,56.790776],[60.605177,56.791631],[60.605451,56.792127],[60.60584,56.79251],[60.606293,56.79287],[60.607209,56.793584],[60.608267,56.794393],[60.609448,56.795281],[60.610549,56.796372],[60.610855,56.796786],[60.625124,56.796782],[60.62853,56.797479],[60.632066,56.79851],[60.636404,56.797117],[60.640507,56.795882],[60.641224,56.797716],[60.641717,56.798792]
                ]
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №16</span><br><br>' +
             '<a href = "../cities/district_16.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №16<br> Нажмите для выбора'
            
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FFD81C',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 17
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.608553,56.79053],[60.615634,56.782032],[60.615935,56.76871],[60.627619,56.768492],[60.63235,56.768533],[60.630784,56.756858],[60.611193,56.739077],[60.60791,56.739123],[60.601116,56.740587],[60.600888,56.742475],[60.603235,56.748608],[60.605109,56.75375],[60.581924,56.757811],[60.582901,56.778274],[60.583303,56.788148],[60.59183,56.789057],[60.601844,56.790418],[60.605606,56.790639]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №17</span><br><br>' +
             '<a href = "../cities/district_17.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-best',
            hintContent: 'Район №17<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FF30A5',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 18
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.710263,56.770788],[60.714297,56.758768],[60.714683,56.7508],[60.714769,56.743869],[60.683999,56.7504],[60.688033,56.76003],[60.698633,56.766211]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №18</span><br><br>' +
             '<a href = "../cities/district_18.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №18<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#1BFAFA',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

      // 19
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.707817,56.811109],[60.712109,56.810592],[60.716057,56.809603],[60.720445,56.808035],[60.723546,56.805807],[60.728203,56.802152],[60.730156,56.799698],[60.728017,56.799032],[60.72898,56.788271],[60.731669,56.788291],[60.73739,56.786153],[60.740143,56.78515],[60.743282,56.784759],[60.745415,56.784658],[60.758691,56.793005],[60.759519,56.798795],[60.763129,56.800708],[60.778165,56.797147],[60.777939,56.79228],[60.782391,56.791056],[60.785326,56.790068],[60.785943,56.788279],[60.782102,56.784818],[60.758906,56.792108],[60.746053,56.784194],[60.746203,56.782416],[60.742147,56.779718],[60.73571,56.781933],[60.728157,56.784524],[60.726827,56.799044],[60.723501,56.800857],[60.717643,56.802387],[60.712965,56.806072],[60.7064,56.807202]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №19</span><br><br>' +
             '<a href = "../cities/district_19.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №19<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#A82DEB',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 20
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.816564,56.768585],[60.81338,56.763914],[60.805322,56.757801],[60.818481,56.751987],[60.822936,56.752073],[60.82722,56.756215],[60.81694,56.761976],[60.81947,56.766834],[60.82303,56.766739],[60.826419,56.765395],[60.826947,56.767364],[60.828419,56.768108],[60.834567,56.768078],[60.834589,56.770989],[60.826928,56.771095],[60.82703,56.768741],[60.825372,56.768721]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №20</span><br><br>' +
             '<a href = "../cities/district_20.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №20<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#F02626',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

        // 20
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                
                [
                    [60.890271,56.787504],[60.879993,56.788328],[60.873577,56.780041],[60.88231,56.777449],[60.887868,56.782285]
                ] 
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContentHeader:'<span class="description">Вы выбрали район №20</span><br><br>' +
             '<a href = "../cities/district_20.html">КОММЕРЧЕСКОЕ ПРЕДЛОЖЕНИЕ</a><br>' 
            ,
            // balloonContentBody: '<img src="compred-revda.jpg" > <br/> ' +
            // '<a href="tel:+7-922-025-67-67">Звонить</a><br/>' +
            // '<b>Нар</b> <br/> палюбому.', 
            balloonContentFooter: 'Media-Best"',
            hintContent: 'Район №20<br> Нажмите для выбора'
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#F02626',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

    // objectManager = new ymaps.ObjectManager({
    //         // Чтобы метки начали кластеризоваться, выставляем опцию.
    //     clusterize: true,
    //         // ObjectManager принимает те же опции, что и кластеризатор.
    //     gridSize: 32,
    //     clusterDisableClickZoom: true
    // });

    // // Чтобы задать опции одиночным объектам и кластерам,
    // // обратимся к дочерним коллекциям ObjectManager.
    // objectManager.objects.options.set('preset', 'islands#greenDotIcon');
    // objectManager.clusters.options.set('preset', 'islands#greenClusterIcons');
    // myMap.geoObjects.add(objectManager);

    // $.ajax({
    //     url: "data.json"
    // }).done(function(data) {
    //     objectManager.add(data);
    // });

      // // Создадим собственный макет выпадающего списка.
      //   ListBoxLayout = ymaps.templateLayoutFactory.createClass(
      //       "<button id='my-listbox-header' class='btn btn-success dropdown-toggle' data-toggle='dropdown'>" +
      //           "{{data.title}} <span class='caret'></span>" +
      //       "</button>" +
      //       // Этот элемент будет служить контейнером для элементов списка.
      //       // В зависимости от того, свернут или развернут список, этот контейнер будет
      //       // скрываться или показываться вместе с дочерними элементами.
      //       "<ul id='my-listbox'" +
      //           " class='dropdown-menu' role='menu' aria-labelledby='dropdownMenu'" +
      //           " style='display: {% if state.expanded %}block{% else %}none{% endif %};'></ul>", {

      //       build: function() {
      //           // Вызываем метод build родительского класса перед выполнением
      //           // дополнительных действий.
      //           ListBoxLayout.superclass.build.call(this);

      //           this.childContainerElement = $('#my-listbox').get(0);
      //           // Генерируем специальное событие, оповещающее элемент управления
      //           // о смене контейнера дочерних элементов.
      //           this.events.fire('childcontainerchange', {
      //               newChildContainerElement: this.childContainerElement,
      //               oldChildContainerElement: null
      //           });
      //       },

      //       // Переопределяем интерфейсный метод, возвращающий ссылку на
      //       // контейнер дочерних элементов.
      //       getChildContainerElement: function () {
      //           return this.childContainerElement;
      //       },

      //       clear: function () {
      //           // Заставим элемент управления перед очисткой макета
      //           // откреплять дочерние элементы от родительского.
      //           // Это защитит нас от неожиданных ошибок,
      //           // связанных с уничтожением dom-элементов в ранних версиях ie.
      //           this.events.fire('childcontainerchange', {
      //               newChildContainerElement: null,
      //               oldChildContainerElement: this.childContainerElement
      //           });
      //           this.childContainerElement = null;
      //           // Вызываем метод clear родительского класса после выполнения
      //           // дополнительных действий.
      //           ListBoxLayout.superclass.clear.call(this);
      //       }
      //   }),

      //   // Также создадим макет для отдельного элемента списка.
      //   ListBoxItemLayout = ymaps.templateLayoutFactory.createClass(
      //       "<li><a>{{data.content}}</a></li>"
      //   ),

      //   // Создадим 2 пункта выпадающего списка
      //   listBoxItems = [
      //       new ymaps.control.ListBoxItem({
      //           data: {
      //               content: 'Екатеринбург',
      //               center: [56.837541, 60.611031],
      //               zoom: 11
      //           }
      //       }),
      //       new ymaps.control.ListBoxItem({
      //           data: {
      //               content: 'Первоуральск',
      //               center: [56.907666, 59.952538],
      //               zoom: 13
      //           }
      //       }),
      //       new ymaps.control.ListBoxItem({
      //           data: {
      //               content: 'Ревда',
      //               center: [56.801204, 59.926445],
      //               zoom: 13
      //           }
      //       }),
      //       new ymaps.control.ListBoxItem({
      //           data: {
      //               content: 'Полевской',
      //               center: [56.472927, 60.216508],
      //               zoom: 12
      //           }
      //       })
      //   ],

      //   // Теперь создадим список, содержащий 2 пункта.
      //   listBox = new ymaps.control.ListBox({
      //           items: listBoxItems,
      //           data: {
      //               title: 'Выберите пункт'
      //           },
      //           options: {
      //               // С помощью опций можно задать как макет непосредственно для списка,
      //               layout: ListBoxLayout,
      //               // так и макет для дочерних элементов списка. Для задания опций дочерних
      //               // элементов через родительский элемент необходимо добавлять префикс
      //               // 'item' к названиям опций.
      //               itemLayout: ListBoxItemLayout
      //           }
      //       });

      //   listBox.events.add('click', function (e) {
      //       // Получаем ссылку на объект, по которому кликнули.
      //       // События элементов списка пропагируются
      //       // и их можно слушать на родительском элементе.
      //       var item = e.get('target');
      //       // Клик на заголовке выпадающего списка обрабатывать не надо.
      //       if (item != listBox) {
      //           myMap.setCenter(
      //               item.data.get('center'),
      //               item.data.get('zoom')
      //           );
      //       }
      //   });

    // myMap.controls.add(listBox, {float: 'left'});

    
   
}
